{"class_name": "Model", "config": {"name": "model", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "lambda", "class_name": "Lambda", "config": {"name": "lambda", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAABwAAAAYAAABDAAAAc2oAAABkAWQAbAB9AWQCfQJ8AGQAZACFAmQAZACFAnwCCwBk\nAIUCZABkAIUCZgQZAH0DfAB9BHwAZABkAIUCZABkAIUCZAB8AoUCZABkAIUCZgQZAH0FfAFqAXwD\nfAR8BWcDZAJkA40CfQZ8BlMAKQRO6QAAAADpAgAAACkB2gRheGlzKQLaCnRlbnNvcmZsb3faBmNv\nbmNhdCkH2gF42gJ0ZtoBcNoLbWlkZGxlX2xlZnTaDW1pZGRsZV9jZW50ZXLaDG1pZGRsZV9yaWdo\ndNoGbWlkZGxlqQByDQAAAPoTVHJpcGxlU2lhbWVzZUNOTi5wedoRcGVyaW9kaWNfcGFkZGluZzKc\nAAAAcw4AAAAAAQgBBAEiAQQBIAEUAQ==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "batch_normalization", "class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["lambda", 0, 0, {}]]]}, {"name": "PConv1", "class_name": "Conv2D", "config": {"name": "PConv1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization", 0, 0, {}]]]}, {"name": "max_pooling2d", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["PConv1", 0, 0, {}]]]}, {"name": "lambda_1", "class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAABwAAAAYAAABDAAAAc2oAAABkAWQAbAB9AWQCfQJ8AGQAZACFAmQAZACFAnwCCwBk\nAIUCZABkAIUCZgQZAH0DfAB9BHwAZABkAIUCZABkAIUCZAB8AoUCZABkAIUCZgQZAH0FfAFqAXwD\nfAR8BWcDZANkBI0CfQZ8BlMAKQVO6QAAAADpAQAAAOkCAAAAKQHaBGF4aXMpAtoKdGVuc29yZmxv\nd9oGY29uY2F0KQfaAXjaAnRm2gFw2gttaWRkbGVfbGVmdNoNbWlkZGxlX2NlbnRlctoMbWlkZGxl\nX3JpZ2h02gZtaWRkbGWpAHIOAAAA+hNUcmlwbGVTaWFtZXNlQ05OLnB52hFwZXJpb2RpY19wYWRk\naW5nMZMAAABzDgAAAAABCAEEASIBBAEgARQB\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "inbound_nodes": [[["max_pooling2d", 0, 0, {}]]]}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"name": "PConv2", "class_name": "Conv2D", "config": {"name": "PConv2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "lambda_2", "class_name": "Lambda", "config": {"name": "lambda_2", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAABwAAAAYAAABDAAAAc2oAAABkAWQAbAB9AWQCfQJ8AGQAZACFAmQAZACFAnwCCwBk\nAIUCZABkAIUCZgQZAH0DfAB9BHwAZABkAIUCZABkAIUCZAB8AoUCZABkAIUCZgQZAH0FfAFqAXwD\nfAR8BWcDZANkBI0CfQZ8BlMAKQVO6QAAAADpAQAAAOkCAAAAKQHaBGF4aXMpAtoKdGVuc29yZmxv\nd9oGY29uY2F0KQfaAXjaAnRm2gFw2gttaWRkbGVfbGVmdNoNbWlkZGxlX2NlbnRlctoMbWlkZGxl\nX3JpZ2h02gZtaWRkbGWpAHIOAAAA+hNUcmlwbGVTaWFtZXNlQ05OLnB52hFwZXJpb2RpY19wYWRk\naW5nMZMAAABzDgAAAAABCAEEASIBBAEgARQB\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "inbound_nodes": [[["PConv2", 0, 0, {}]]]}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["lambda_2", 0, 0, {}]]]}, {"name": "lambda_3", "class_name": "Lambda", "config": {"name": "lambda_3", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAABwAAAAYAAABDAAAAc2oAAABkAWQAbAB9AWQCfQJ8AGQAZACFAmQAZACFAnwCCwBk\nAIUCZABkAIUCZgQZAH0DfAB9BHwAZABkAIUCZABkAIUCZAB8AoUCZABkAIUCZgQZAH0FfAFqAXwD\nfAR8BWcDZANkBI0CfQZ8BlMAKQVO6QAAAADpAQAAAOkCAAAAKQHaBGF4aXMpAtoKdGVuc29yZmxv\nd9oGY29uY2F0KQfaAXjaAnRm2gFw2gttaWRkbGVfbGVmdNoNbWlkZGxlX2NlbnRlctoMbWlkZGxl\nX3JpZ2h02gZtaWRkbGWpAHIOAAAA+hNUcmlwbGVTaWFtZXNlQ05OLnB52hFwZXJpb2RpY19wYWRk\naW5nMZMAAABzDgAAAAABCAEEASIBBAEgARQB\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"name": "PConv3", "class_name": "Conv2D", "config": {"name": "PConv3", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_3", 0, 0, {}]]]}, {"name": "max_pooling2d_1", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["PConv3", 0, 0, {}]]]}, {"name": "dropout", "class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"name": "flatten", "class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["dropout", 0, 0, {}]]]}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"name": "dense", "class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 128, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"name": "lambda_4", "class_name": "Lambda", "config": {"name": "lambda_4", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcw4AAAB0AGoBfABkAWQCjQJTACkDTukBAAAAKQHaBGF4aXMp\nAtoBS9oMbDJfbm9ybWFsaXplKQHaAXSpAHIGAAAA+hNUcmlwbGVTaWFtZXNlQ05OLnB52gg8bGFt\nYmRhPsUAAABzAAAAAA==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "inbound_nodes": [[["dense", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["lambda_4", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}